import { InMemoryDbService } from 'angular-in-memory-web-api';
//asd
import { Person } from '../app/models/person';
import { Transaction } from "../app/models/transaction";
import { Representation } from "../app/app.component";
export class AppData implements InMemoryDbService {
    createDb() {
        let persons: Person[] = [
            {
                'id': 1,
                'name': "Παναγιωτόπουλος Παναγιώτης του Πέτρου"
            },
            {
                'id': 2,
                'name': "Παπαπέτρου Νίκος του Ιωάννου"
            },
            {
                'id': 3,
                'name': "Ψηλός Γιάννης του Δημητρίου"
            }
        ];

        let transactions: Transaction[] = [
            {
                "id": 1,
                "name": "Άνοιγμα / Κλείσιμο λογαριασμών χρηματικών καταθέσεων"
            },
            {
                "id": 2,
                "name": "Ανάληψη μετρητών"
            },
            {
                "id": 3,
                "name": "Έκδοση επιταγών"
            },
            {
                "id": 4,
                "name": "Εντολή κάθε είδους μεταφοράς"
            },
            {
                "id": 5,
                "name": "Οπισθογράφηση επιταγών"
            },
            {
                "id": 6,
                "name": "Είσπραξη εισερχόμενων εμβασμάτων"
            },
            {
                "id": 7,
                "name": "Μίσθωση και χρήση θυρίδας θησαυροφυλακίου - Λύση μισθώσεως θυρίδας"
            },
            {
                "id": 8,
                "name": "Αγοραπωλησία συναλλάγματος εμπορευματικών πράξεων (τοις μετρητοίς ή προθεσμιακών)"
            },
            {
                "id": 9,
                "name": "Άνοιγμα ενέγγυων πιστώσεων"
            },
            {
                "id": 10,
                "name": "Παραλαβή φορτωτικών εγγράφων"
            },
            {
                "id": 11,
                "name": "Έκδοση, αποδοχή, οπισθογράφηση, προεξόφληση συναλλαγματικών και γραμματίων εις διαταγήν"
            },
            {
                "id": 12,
                "name": "Συνομολόγηση συμβάσεων δανείων και πιστώσεων (ΑΤΛ)"
            },
            {
                "id": 13,
                "name": "Λήψη δανείων και χρήση πιστώσεων"
            },
            {
                "id": 14,
                "name": "Συνομολόγηση και χρήση συμβάσεων πρακτορείας επιχειρηματικών απαιτήσεων"
            },
            {
                "id": 15,
                "name": "Αίτηση/σύμβαση εκδόσεως εγγυητικών επιστολών"
            },
            {
                "id": 16,
                "name": "Άνοιγμα, κλείσιμο, κίνηση λογαριασμών κινητών αξιών"
            },
            {
                "id": 17,
                "name": "Αγορές ή πωλήσεις κινητών αξιών"
            },
            {
                "id": 18,
                "name": "Συνομολόγηση και χρήση συμβάσεων φυλάξεως κινητών αξιών"
            },
            {
                "id": 19,
                "name": "Συνομολόγηση και χρήση συμβάσεων διαχειρίσεως κινητών αξιών (με εντολές ή βάσει γενικού πλαισίου ή άλλης μορφής)"
            },
            {
                "id": 20,
                "name": "Πράξεις κινήσεως κεφαλαίων (ΠΔ 96 & 104)"
            },
            {
                "id": 21,
                "name": "Συμφωνίες σχετικές με χρηματοοικονομικές τεχνικές και παράγωγα προϊόντα, όπως προθεσμιακές πράξεις επί κινητών αξιών ή συναλλάγματος, συμφωνίες ανταλλαγής κεφαλαίου και επιτοκίων κ.λπ."
            },
            {
                "id": 22,
                "name": "Ενέχυρο επί κινητών ή απαιτήσεων (ομολόγων, μετοχών, επιταγών, συναλλαγματικών, καταθέσεων μετρητών, μισθωμάτων κ.λπ.)"
            },
            {
                "id": 23,
                "name": "Πράξεις υπέρ τρίτου φυσικού ή νομικού προσώπου (εγγύηση, ενέχυρο επί κινητών ή ενεχύραση απαιτήσεων, αίτημα για έκδοση εγγυητικής επιστολής κ.λπ.)"
            },
            {
                "id": 24,
                "name": "Παροχή εμπράγματης ασφάλειας σε ακίνητα (υποθήκη, προσημείωση υποθήκης)"
            },
            {
                "id": 25,
                "name": "Συνομολόγηση σύμβασης"
            },
            {
                "id": 26,
                "name": "Κίνηση καταθετικών ή χορηγητικών λογαριασμών με εντολές κάθε είδους μεταφοράς / Αίτηση χορήγησης μπλοκ επιταγών / Ενημέρωση: κίνησης και υπολοίπου λογαριασμών, εκδοθεισών εγγυητικών επιστολών υπέρ της εταιρείας, κατάστασης επιταγών εκδόσεως της εταιρείας ή τρίτων / Πρόσβαση σε έγγραφα περιοδικής ενημέρωσης κάθε είδους λογαριασμού (e-Statement) - Διακοπή/Επαναφορά ταχυδρομικής αποστολής εγγράφων περιοδικής ενημέρωσης κάθε είδους λογαριασμού. / Εντολές διαχείρισης επιταγών εκδόσεως τρίτων (σφράγιση επί μη πληρωμή, μη σφράγιση και επιστροφή επιταγής απλήρωτης και ασφράγιστης, επανεμφάνιση επιταγής προς είσπραξη) / Εισαγωγές/Εξαγωγές (Trade Finance): αίτηση για άνοιγμα ενέγγυας πίστωσης, αποδοχή όρων διεκπεραίωσης εισαγωγών/εξαγωγών μέσω της υπηρεσίας Internet Banking, εντολές μεταφοράς για την πληρωμή αξιών έναντι φορτωτικών εγγράφων με χρέωση καταθετικού ή χορηγητικού λογαριασμού"
            }
        ];

        let representations: Representation[] = [

        ];

        return { persons, transactions, representations };
    }
}